ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR16DD28def.inc
; BOD Operation in Active Mode select
.equ FUSE_ACTIVE_DISABLE_gc = (0x00<<2)  ; BOD disabled
.equ FUSE_ACTIVE_ENABLE_gc = (0x01<<2)   ; BOD enabled in continuous mode
.equ FUSE_ACTIVE_SAMPLE_gc = (0x02<<2)   ; BOD enabled in sampled mode
.equ FUSE_ACTIVE_ENABLEWAIT_gc = (0x03<<2) ; BOD enabled in continuous mode. Execution is halted at wake-up until BOD is running.

; BOD Level select
.equ FUSE_LVL_BODLEVEL0_gc = (0x00<<5)   ; 1.9V
.equ FUSE_LVL_BODLEVEL1_gc = (0x01<<5)   ; 2.45V
.equ FUSE_LVL_BODLEVEL2_gc = (0x02<<5)   ; 2.7V
.equ FUSE_LVL_BODLEVEL3_gc = (0x03<<5)   ; 2.85V

; BOD Sample Frequency select
.equ FUSE_SAMPFREQ_128Hz_gc = (0x00<<4)  ; Sample frequency is 128 Hz
.equ FUSE_SAMPFREQ_32Hz_gc = (0x01<<4)   ; Sample frequency is 32 Hz

; BOD Operation in Sleep Mode select
.equ FUSE_SLEEP_DISABLE_gc = (0x00<<0)   ; BOD disabled
.equ FUSE_SLEEP_ENABLE_gc = (0x01<<0)    ; BOD enabled in continuous mode
.equ FUSE_SLEEP_SAMPLE_gc = (0x02<<0)    ; BOD enabled in sampled mode

; Frequency Select
.equ FUSE_CLKSEL_OSCHF_gc = (0x00<<0)    ; 1-32MHz internal oscillator
.equ FUSE_CLKSEL_OSC32K_gc = (0x01<<0)   ; 32.768kHz internal oscillator

; CRC Select
.equ FUSE_CRCSEL_CRC16_gc = (0x00<<5)    ; Enable CRC16
.equ FUSE_CRCSEL_CRC32_gc = (0x01<<5)    ; Enable CRC32

; CRC Source select
.equ FUSE_CRCSRC_FLASH_gc = (0x00<<6)    ; CRC of full Flash (boot, application code and application data)
.equ FUSE_CRCSRC_BOOT_gc = (0x01<<6)     ; CRC of boot section
.equ FUSE_CRCSRC_BOOTAPP_gc = (0x02<<6)  ; CRC of application code and boot sections
.equ FUSE_CRCSRC_NOCRC_gc = (0x03<<6)    ; No CRC

; Reset Pin Configuration select
.equ FUSE_RSTPINCFG_GPIO_gc = (0x00<<3)  ; GPIO mode
.equ FUSE_RSTPINCFG_RST_gc = (0x01<<3)   ; Reset mode

; UPDI Pin Configuration select
.equ FUSE_UPDIPINCFG_GPIO_gc = (0x00<<4) ; GPIO Mode
.equ FUSE_UPDIPINCFG_UPDI_gc = (0x01<<4) ; UPDI Mode

; MVIO System Configuration select
.equ FUSE_MVSYSCFG_DUAL_gc = (0x01<<3)   ; Device used in a dual supply configuration
.equ FUSE_MVSYSCFG_SINGLE_gc = (0x02<<3) ; Device used in a single supply configuration

; Startup Time select
.equ FUSE_SUT_0MS_gc = (0x00<<0)         ; 0 ms
.equ FUSE_SUT_1MS_gc = (0x01<<0)         ; 1 ms
.equ FUSE_SUT_2MS_gc = (0x02<<0)         ; 2 ms
.equ FUSE_SUT_4MS_gc = (0x03<<0)         ; 4 ms
.equ FUSE_SUT_8MS_gc = (0x04<<0)         ; 8 ms
.equ FUSE_SUT_16MS_gc = (0x05<<0)        ; 16 ms
.equ FUSE_SUT_32MS_gc = (0x06<<0)        ; 32 ms
.equ FUSE_SUT_64MS_gc = (0x07<<0)        ; 64 ms

; Watchdog Timeout Period select
.equ FUSE_PERIOD_OFF_gc = (0x00<<0)      ; Watch-Dog timer Off
.equ FUSE_PERIOD_8CLK_gc = (0x01<<0)     ; 8 cycles (8ms)
.equ FUSE_PERIOD_16CLK_gc = (0x02<<0)    ; 16 cycles (16ms)
.equ FUSE_PERIOD_32CLK_gc = (0x03<<0)    ; 32 cycles (32ms)
.equ FUSE_PERIOD_64CLK_gc = (0x04<<0)    ; 64 cycles (64ms)
.equ FUSE_PERIOD_128CLK_gc = (0x05<<0)   ; 128 cycles (0.128s)
.equ FUSE_PERIOD_256CLK_gc = (0x06<<0)   ; 256 cycles (0.256s)
.equ FUSE_PERIOD_512CLK_gc = (0x07<<0)   ; 512 cycles (0.512s)
.equ FUSE_PERIOD_1KCLK_gc = (0x08<<0)    ; 1K cycles (1.0s)
.equ FUSE_PERIOD_2KCLK_gc = (0x09<<0)    ; 2K cycles (2.0s)
.equ FUSE_PERIOD_4KCLK_gc = (0x0A<<0)    ; 4K cycles (4.0s)
.equ FUSE_PERIOD_8KCLK_gc = (0x0B<<0)    ; 8K cycles (8.0s)

; Watchdog Window Timeout Period select
.equ FUSE_WINDOW_OFF_gc = (0x00<<4)      ; Window mode off
.equ FUSE_WINDOW_8CLK_gc = (0x01<<4)     ; 8 cycles (8ms)
.equ FUSE_WINDOW_16CLK_gc = (0x02<<4)    ; 16 cycles (16ms)
.equ FUSE_WINDOW_32CLK_gc = (0x03<<4)    ; 32 cycles (32ms)
.equ FUSE_WINDOW_64CLK_gc = (0x04<<4)    ; 64 cycles (64ms)
.equ FUSE_WINDOW_128CLK_gc = (0x05<<4)   ; 128 cycles (0.128s)
.equ FUSE_WINDOW_256CLK_gc = (0x06<<4)   ; 256 cycles (0.256s)
.equ FUSE_WINDOW_512CLK_gc = (0x07<<4)   ; 512 cycles (0.512s)
.equ FUSE_WINDOW_1KCLK_gc = (0x08<<4)    ; 1K cycles (1.0s)
.equ FUSE_WINDOW_2KCLK_gc = (0x09<<4)    ; 2K cycles (2.0s)
.equ FUSE_WINDOW_4KCLK_gc = (0x0A<<4)    ; 4K cycles (4.0s)
.equ FUSE_WINDOW_8KCLK_gc = (0x0B<<4)    ; 8K cycles (8.0s)


;*************************************************************************
;** GPR - General Purpose Registers
;*************************************************************************


;*************************************************************************
;** LOCK - Lockbits
;*************************************************************************

; LOCK_KEY masks
.equ LOCK_KEY_gm = 0xFFFFFFFF            ; Lock Key group mask
.equ LOCK_KEY_gp = 0                     ; Lock Key group position
.equ LOCK_KEY_0_bm = (1<<0)              ; Lock Key bit 0 mask
.equ LOCK_KEY_0_bp = 0                   ; Lock Key bit 0 position
.equ LOCK_KEY_1_bm = (1<<1)              ; Lock Key bit 1 mask
.equ LOCK_KEY_1_bp = 1                   ; Lock Key bit 1 position
.equ LOCK_KEY_2_bm = (1<<2)              ; Lock Key bit 2 mask
.equ LOCK_KEY_2_bp = 2                   ; Lock Key bit 2 position
.equ LOCK_KEY_3_bm = (1<<3)              ; Lock Key bit 3 mask
.equ LOCK_KEY_3_bp = 3                   ; Lock Key bit 3 position
.equ LOCK_KEY_4_bm = (1<<4)              ; Lock Key bit 4 mask
.equ LOCK_KEY_4_bp = 4                   ; Lock Key bit 4 position
.equ LOCK_KEY_5_bm = (1<<5)              ; Lock Key bit 5 mask
.equ LOCK_KEY_5_bp = 5                   ; Lock Key bit 5 position
.equ LOCK_KEY_6_bm = (1<<6)              ; Lock Key bit 6 mask
.equ LOCK_KEY_6_bp = 6                   ; Lock Key bit 6 position
.equ LOCK_KEY_7_bm = (1<<7)              ; Lock Key bit 7 mask
.equ LOCK_KEY_7_bp = 7                   ; Lock Key bit 7 position
.equ LOCK_KEY_8_bm = (1<<8)              ; Lock Key bit 8 mask
.equ LOCK_KEY_8_bp = 8                   ; Lock Key bit 8 position
.equ LOCK_KEY_9_bm = (1<<9)              ; Lock Key bit 9 mask
.equ LOCK_KEY_9_bp = 9                   ; Lock Key bit 9 position
.equ LOCK_KEY_10_bm = (1<<10)            ; Lock Key bit 10 mask
.equ LOCK_KEY_10_bp = 10                 ; Lock Key bit 10 position
.equ LOCK_KEY_11_bm = (1<<11)            ; Lock Key bit 11 mask
.equ LOCK_KEY_11_bp = 11                 ; Lock Key bit 11 position
.equ LOCK_KEY_12_bm = (1<<12)            ; Lock Key bit 12 mask
.equ LOCK_KEY_12_bp = 12                 ; Lock Key bit 12 position
.equ LOCK_KEY_13_bm = (1<<13)            ; Lock Key bit 13 mask
.equ LOCK_KEY_13_bp = 13                 ; Lock Key bit 13 position
.equ LOCK_KEY_14_bm = (1<<14)            ; Lock Key bit 14 mask
.equ LOCK_KEY_14_bp = 14                 ; Lock Key bit 14 position
.equ LOCK_KEY_15_bm = (1<<15)            ; Lock Key bit 15 mask
.equ LOCK_KEY_15_bp = 15                 ; Lock Key bit 15 position
.equ LOCK_KEY_16_bm = (1<<16)            ; Lock Key bit 16 mask
.equ LOCK_KEY_16_bp = 16                 ; Lock Key bit 16 position
.equ LOCK_KEY_17_bm = (1<<17)            ; Lock Key bit 17 mask
.equ LOCK_KEY_17_bp = 17                 ; Lock Key bit 17 position
.equ LOCK_KEY_18_bm = (1<<18)            ; Lock Key bit 18 mask
.equ LOCK_KEY_18_bp = 18                 ; Lock Key bit 18 position
.equ LOCK_KEY_19_bm = (1<<19)            ; Lock Key bit 19 mask
.equ LOCK_KEY_19_bp = 19                 ; Lock Key bit 19 position
.equ LOCK_KEY_20_bm = (1<<20)            ; Lock Key bit 20 mask
.equ LOCK_KEY_20_bp = 20                 ; Lock Key bit 20 position
.equ LOCK_KEY_21_bm = (1<<21)            ; Lock Key bit 21 mask
.equ LOCK_KEY_21_bp = 21                 ; Lock Key bit 21 position
.equ LOCK_KEY_22_bm = (1<<22)            ; Lock Key bit 22 mask
.equ LOCK_KEY_22_bp = 22                 ; Lock Key bit 22 position
.equ LOCK_KEY_23_bm = (1<<23)            ; Lock Key bit 23 mask
.equ LOCK_KEY_23_bp = 23                 ; Lock Key bit 23 position
.equ LOCK_KEY_24_bm = (1<<24)            ; Lock Key bit 24 mask
.equ LOCK_KEY_24_bp = 24                 ; Lock Key bit 24 position
.equ LOCK_KEY_25_bm = (1<<25)            ; Lock Key bit 25 mask
.equ LOCK_KEY_25_bp = 25                 ; Lock Key bit 25 position
.equ LOCK_KEY_26_bm = (1<<26)            ; Lock Key bit 26 mask
.equ LOCK_KEY_26_bp = 26                 ; Lock Key bit 26 position
.equ LOCK_KEY_27_bm = (1<<27)            ; Lock Key bit 27 mask
.equ LOCK_KEY_27_bp = 27                 ; Lock Key bit 27 position
.equ LOCK_KEY_28_bm = (1<<28)            ; Lock Key bit 28 mask
.equ LOCK_KEY_28_bp = 28                 ; Lock Key bit 28 position
.equ LOCK_KEY_29_bm = (1<<29)            ; Lock Key bit 29 mask
.equ LOCK_KEY_29_bp = 29                 ; Lock Key bit 29 position
.equ LOCK_KEY_30_bm = (1<<30)            ; Lock Key bit 30 mask
.equ LOCK_KEY_30_bp = 30                 ; Lock Key bit 30 position
.equ LOCK_KEY_31_bm = (1<<31)            ; Lock Key bit 31 mask
.equ LOCK_KEY_31_bp = 31                 ; Lock Key bit 31 position

; Lock Key select
.equ LOCK_KEY_NOLOCK_gc = (0x5CC5C55C<<0) ; No locks
.equ LOCK_KEY_RWLOCK_gc = (0xA33A3AA3<<0) ; Read and write lock


;*************************************************************************
;** MVIO - Multi-Voltage I/O
;*************************************************************************

; MVIO_INTCTRL masks
.equ MVIO_VDDIO2IE_bm = 0x01             ; VDDIO2 Interrupt Enable bit mask
.equ MVIO_VDDIO2IE_bp = 0                ; VDDIO2 Interrupt Enable bit position

; MVIO_INTFLAGS masks
.equ MVIO_VDDIO2IF_bm = 0x01             ; VDDIO2 Interrupt Flag bit mask
.equ MVIO_VDDIO2IF_bp = 0                ; VDDIO2 Interrupt Flag bit position

; MVIO_STATUS masks
.equ MVIO_VDDIO2S_bm = 0x01              ; VDDIO2 Status bit mask
.equ MVIO_VDDIO2S_bp = 0                 ; VDDIO2 Status bit position


;*************************************************************************
;** NVMCTRL - Non-volatile Memory Controller
;*************************************************************************

